[
  {
    "name": "Init",
    "description": "Started the website under ECRanked.ddns.net",
    "date": "Sep 14 2021"
  },
  {
    "name": "User page update",
    "description": "Added \"Recent games\" and \"Top Loadouts\"to user page",
    "date": "Sep 21 2021"
  },
  {
    "name": "Replay page!",
    "description": "Added a new replay page that contained user loadouts throughout a map and the basics of positions of where people die.",
    "date": "Sep 23 2021"
  },
  {
    "name": "Loadout images",
    "description": "Added new loadout images across the replay page and user page",
    "date": "Sep 24 2021"
  },
  {
    "name": "Account System",
    "description": "Implemented the very basics of account authentication through discord OAuth. I tried super hard to get oculus OAuth to function but they never responded to their emails so we just had to resort to making users sign in through their discord account. this marks a major step to the current stage of ECRanked. This is also around the same time that I started to implement authentication into the backend and start validating requests.",
    "date": "Oct 5 2021"
  },
  {
    "name": "Start of major project",
    "description": "Start of a major feature of ECRanked. this is still a WIP",
    "date": "Oct 17 2021"
  },
  {
    "name": "Online replay viewer",
    "description": "Thanks to the help rev2600 we were able to implement a online replay viewer that downloads the replay from our server and processes and plays it live for you to see",
    "date": "Dec 28 2021"
  },
  {
    "name": "First account ability! About me's",
    "description": "This marks the first ever ability you can do while logged into ECRanked. you are now able to login and edit your accounts \"About me\". There was major infrusture in the backend developed that made sure permissions was validated both on the frontend website but also made it so its impossible to make api requests by impersonating a user because there is now an api-token auth system",
    "date": "Jan 2 2021"
  },
  {
    "name": "Chassis Picture",
    "description": "This is the second ability of being logged in. your now able to upload an image of your chassis to ECRanked and, after a moderators approval, it will be shown publicly on your page across the website and external bots. This marks the first time ECRanked has had to deal with user uploaded files. There is a cool system to make the images publicly available after upload but only when a moderator has approved it.",
    "date": "Jan 4 2021"
  },
  {
    "name": "Loadout Leaderboards",
    "description": "Now its time for ECRanked to actually implement some ranking. Because of the limited data we are able to gather out first ranking is based on loadout usage. there is a custom page for each of the 64 possible loadouts that ranks every single of the 1000's user individual usage of said loadout.",
    "date": "Jan 5 2021"
  },

  {
    "name": "Pub leaderboard and Style change",
    "description": "Added a new leaderboard that is counting the number of games you have played per month. and it resets at the beginning of every month and theres a prize for the first place. and thinned out some of the borders",
    "date": "Jan 9 2021"
  },
  {
    "name": "Heatmaps!",
    "description": "This marks the next milestone in ECRanked development. this update introduces heatmaps. Because the second data we get from the games api is positional adding heatmaps was the next logical step. This was a major undertaking and only took 6 days from idea to final product. There was a lot of new infrastructure including more authencated actions, More image storage,asyncronous processing of data, and a request queue",
    "date": "Jan 24 2021"
  },
  {
    "name": "Random!",
    "description": "This is a very unknown feature of ECRanked in where if you put random in your url in place of a username, gameID, or loadout number the website will then give you a random users page! So if you were to go to https://ecranked.com/user/random/stats youll see a random players stats! same with https://ecranked.com/replay/random will give you a random replay.",
    "date": "Feb 1 2021"
  },
  {
    "name": "Combat Teams",
    "description": "This is the next major progression for ECRanked in where you can organize teams inside of ecranked for use in future tournaments. this only took a day to implement a working beta from the idea",
    "date": "Feb 27 2021"
  }
]
